{"/docs/datafrogs-2022.01.fr/":{"data":{"":"","15-janvier-2022-en-ligne#15 janvier 2022, en ligne":"","programme#Programme":"","programme-détaillé#Programme détaillé":"Inscrivez-vous sur LinkedIn Events.\n15 janvier 2022, en ligne DataFrogs est une conférence communautaire gratuite sur Microsoft SQL Server.\nCette session aura lieu le samedi 15 janvier en virtuel (lien fourni plus tard).\nInscrivez-vous sur LinkedIn Events pour obtenir les informations pratiques.\nLes sessions seront disponibles pour tous, et concerneront principalement SQL Server on-premises ou sur Azure, le moteur relationnel, vous savez…\nIl n’y aura aucun “Power…” dans ces sessions, c’est garanti !\nProgramme Heure Session Qui 09h00 Stockage SQL, virtualisation et performances David Barbarin, Migros Online 10h15 Les groupes de disponibilité AlwaysOn par la pratique Christophe Laporte 11h30 Je veux migrer mes bases dans Azure MAIS … Julien Pierre, Microsoft et Sylvain Pagès 13h30 Gérer les bases de données à forte volumétrie Arian Papillon, Datafly, MVP 14h45 SQL Server sur Google Cloud Platform Clément Hugé 16h00 Simplifier vos projets BI grâce à Azure Data Factory Sébastien Kobenan 17h15 Query Store, bientôt incontournable ? Steven NAUDET, DBI Services Programme détaillé 09h00 ➤ Stockage SQL, virtualisation et performances David Barbarin, Migros Online\nVirtualiser SQL Server avec VMWare est devenue monnaie courante depuis quelques années. Rare sont devenues les infrastructures dites uniquement Bar Metal. Quid de la performance avec une instance SQL Server dans ce cas? Est-ce que virtualisation rime avec performance? Quelles considérations à avoir lorsqu’il s’agit du stockage, qui plus est dans un environnement à ressources partagées ? Dans cette session, nous appliquerons les fondamentaux du stockage SQL Server pour la mise en place d’une infrastructure de stockage performante.\n10h15 ➤ Les groupes de disponibilité AlwaysOn par la pratique Christophe Laporte, ConseilIT\nInstaller et configurer SQL Server est relativement simple, à fortiori si vous procédez via des scripts. Ajouter une fonctionnalité de haute disponibilité l’est tout autant. Après avoir abordé les principes théoriques du cluster et des groupes de disponibilités, nous utiliserons des scripts PowerShell afin d’effectuer une mise en œuvre automatisée. Finalement, nous aborderons les problématiques de sauvegarde, d’implémentation dans un environnement Cloud, etc …\n11h30 ➤ Je veux migrer mes bases dans Azure MAIS … Julien Pierre, Microsoft et Sylvain Pagès\nVous êtes nombreux à vous poser des questions sur comment maîtriser la migration de vos bases dans Azure.\nSylvain et Julien partageront leur expérience et leurs retours terrain sur les nombreux projets de migration de bases SQL Server vers Azure SQL.\nQuels sont les différents chemins de migrations OnPrem vers Azure ?\nQuels sont les pièges et comment les éviter ?\nQuelles sont les recommandations à suivre ?\n13h30 ➤ Gérer les bases de données à forte volumétrie Arian Papillon, Datafly, MVP\nL’administration des bases de données devient plus délicate lorsqu’on gère de fortes volumétries.\nDans cette session nous évoquerons les problématiques et les solutions propres aux bases de données volumineuses.\nPerformances et Indexation Stockage et partitionnement Administration et sauvegardes Outils, trucs et astuces 14h45 ➤ SQL Server sur Google Cloud Platform Clément Hugé, Google\nSQL Server est disponible en IaaS (Infrastructure as a Service) et PaaS (Platform as a Service) sur Google Cloud Plaform (GCP).\nDans cette session, nous allons voir comment créer une instance, la gérer et s’y connecter.\nNous aborderons également les diférentes fonctionnalités, comme la haute disponibilité, les sauvegardes automatiques, le clonage, la supervision, et comment sécuriser les données au repos et en transit.\n16h00 ➤ Simplifier vos projets BI grâce à Azure Data Factory Sébastien Kobenan, Exakis Nelite\nBrève présentation du service Azure Data Factory Architecture type d’un projet Data Factory Présentation d’un cas d’utilisation de Data Factory : Copie de fichiers d’Azure Data Lake Gen2 vers une base de données Azure SQL (avec brève présentation d’Azure Data Lake et Azure SQL) Sécurisation des données dans Azure Virtual Network (seules des ressources Azure dans le VNet pourront accéder aux données soit dans le Data Lake ou soit dans Azure SQL) Communication entre les différents services dans le VNet via des Private Endpoint : pour lire/écrire des données dans le Data Lake ou dans Azure SQL, Data Factory devra passer par des Private Endpoint. (Là aussi brève explication de ce qu’est un Private Endpoint) Authentification via des Managed Identities : pour lire/écrire des données dans Azure Data Lake ou Azure SQL, Data Factory devra s’authentifier à travers des Managed Identities. (avec bien sûr une brève présentation de d’Azure Managed Identities) 17h15 ➤ Query Store, bientôt incontournable ? Steven NAUDET, DBI Services\nSteven a 10 ans d’expérience SQL Server, il est actuellement consutant chez dbi services, en Suisse.\nLe Query Store est une fonctionnalité disponible depuis SQL Server 2016 mais semble toujours assez peu utilisé.\nLes informations déjà connues autour de la version 2022 annoncent un Query Store omniprésent sur SQL Server.\nDans cette session nous verrons en introduction ce qu’est le Query Store. Puis nous ferons le tour des fonctionnalités récentes et à venir en lien avec Query Store comme l’Automatic Tuning ou les Query Store Hints."},"title":"DataFrogs 2022.01"},"/docs/datafrogs-2023.01.fr/":{"data":{"":"","18-mars-2023-en-ligne#18 mars 2023, en ligne":"","programme#Programme":"","programme-détaillé#Programme détaillé":"Inscrivez-vous sur LinkedIn Events.\n18 mars 2023, en ligne DataFrogs est une conférence communautaire gratuite sur Microsoft SQL Server.\nCette session aura lieu le samedi 18 mars en virtuel (lien fourni plus tard).\nInscrivez-vous sur LinkedIn Events pour obtenir les informations pratiques.\nLes sessions seront disponibles pour tous, et concerneront principalement SQL Server on-premises ou sur Azure, le moteur relationnel, vous savez…\nProgramme Heure Session Qui Lien 09h00 Azure Synapse, en avant les pools Sylvain Pagès, Devoteam Teams 10h15 SQL Server, les structures de données Christophe Laporte, ConseilIt, MVP Teams 11h30 Les bonnes mauvaises pratiques des groupes de disponibilité AlwaysOn Amar Adghar, Microsoft et Stéphane Scherrer, Microsoft Teams 13h30 Adoptez une approche Lakehouse pour vos projets BI avec Azure Synapse Analytics Sébastien Kobenan, Exakis Nelite Teams 14h45 Les nouveautés SQL Server 2022 Julien Pierre, Microsoft et Pascal Deliot, Microsoft Teams 16h00 Une histoire de mots… l’indexation textuelle Frédéric Brouard, SQL Spot et Arian Papillon, Datafly, MVP Teams 17h15 SQL Server nostalgie La communauté SQL Server francophone Teams Programme détaillé 09h00 ➤ Azure Synapse, en avant les pools Sylvain Pagès, Devoteam\nAvec l’arrivé d’Azure Synapse Analytics, nous avons à disposition des pools Dedicated et Serveless.\nOn fait le tour sans casser d’œufs de poules ?\nlien Teams\n10h15 ➤ SQL Server, les structures de données Christophe Laporte, ConseilIt, MVP\nTout développeur ou administrateur de bases de données devrait comprendre comment SQL Server accède aux données.\nCette session vous permettra de revoir les basiques sur le stockage des données, les différents types d’index, mais aussi d’évaluer leur usage au travers de DMV/DMF. Les nombreuses démonstrations permettront également de comprendre certains opérateurs des plans d’exécution.\nlien Teams\n11h30 ➤ Les bonnes mauvaises pratiques des groupes de disponibilité AlwaysOn Amar Adghar, Microsoft et Stéphane Scherrer, Microsoft\nDepuis dix ans, les Groupes de Disponibilité (AG pour Availability Groups) AlwaysOn permettent d’implémenter une haute disponibilité de qualité avec SQL Server. Encore faut-il les installer et les gérer correctement. Cela implique de comprendre le service de Cluster de Windows et les spécificités de cette fonctionnalité dans SQL Server.\nDans cette session, Stéphane Scherrer et Amar Adghar vous font bénéficier de leur expérience de terrain au sein de Microsoft pour vous aider à ne pas vous tromper sur les bonnes pratiques pour les AG.\nSujets abordés :\nRappel des AG AlwaysOn, et fonctionnement du journal de transactions. Les bénéfices des AG sur les clusters de basculement (FCI) : HA+DR, auto-fix pages, DB level failure detection. Retours d’expérience terrain. Les points importants : Worker threads, copie des logins, maintenance AG aware. Interaction WSFC et AG. Les fausses bonnes pratiques. lien Teams\n13h30 ➤ Adoptez une approche Lakehouse pour vos projets BI avec Azure Synapse Analytics Sébastien Kobenan, Exakis Nelite\nData Warehouse ou Data Lake ?\nNe choisissez plus. Adoptez une approche Lakehouse.\nVous souhaitez construire une plateforme de données moderne dans votre entreprise ? Vous connaissez les Data Warehouse, solution mature et éprouvée qui existe depuis maintenant plusieurs décennies ? Vous avez aussi entendu parler des Data Lakes, une approche qui s’est particulièrement popularisée au cours de la dernière décennie ?\nVous vous demandez quelle approche adopter ?\nDans cette session nous allons voir ensemble :\nUne architecture d’un projet BI avec une approche Data Warehouse. Une architecture d’un projet BI avec une approche Data Lake. Les avantages et les inconvénients de chacune des deux approches. Et surtout nous allons voir que vous pouvez avoir le meilleur des deux mondes avec une approche Lakehouse dans Azure Synapse Analytics.\nlien Teams\n14h45 ➤ Les nouveautés SQL Server 2022 Julien Pierre, Microsoft et Pascal Deliot, Microsoft\n2022 a été marqué par de bien nombreux événements : Les élections présidentielles / La guerre en Ukraine / La mort de la reine d’Angleterre… Et l’arrivée de SQL Server 2022 !\nQuoi vous avez loupé ça ! Aller en route vers le cloud ! On embarque vers une vague de nouveautés au menu :\nLes nouveautés Query Store. Des nouveautés côté Moteur (Built-in Query Intelligence). Des nouveautés qui nous emmènent vers l’infini et au delà (le cloud). Des bonnes pratiques SQL (c’est toujours bien de revenir sur terre ). Bref quelques trucs sympathiques à venir voir !\nlien Teams\n16h00 ➤ Une histoire de mots… l’indexation textuelle Frédéric Brouard, SQL Spot et Arian Papillon, Datafly, MVP\nS’il existe des outils externes comme Lucène/SOLR ou Elastic Search ( tous deux basés sur Java), il ne faut pas oublier que l’indexation textuelle est née des travaux des éditeurs de bases de données et a été consacrée par le comité de normalisation du langage SQL. Ainsi tous les SGBDR incorporent un outil de recherche textuelle plus ou moins conforme à la norme et plus ou moins performant.\nCette présentation à pour but de vous montrer comment réaliser une indexation textuelle des tables et documents électroniques par le biais de Microsoft SQL Server, la gérer, en tirer parti en effectuant des recherches textuelles ou sémantiques et enfin, d’en considérer les performances.\nlien Teams\n17h15 ➤ SQL Server nostalgie Avec les vieux de la vieille de SQL Server, à micros ouverts.\nIl paraît que la nostalgie est une mauvaise émotion. Mais ça fait du bien de temps en temps. Venez suivre et partager vos anecdotes dans la dernière session de la journée, une session « apéro ».\nSouvenirs, faits marquants, surprenants, intéressants ou drôles qui nous sont arrivés avec une fonctionnalité des anciennes versions de SQL Server.\nlien Teams"},"title":"DataFrogs 2023.01"},"/docs/datafrogs-2023.02.fr/":{"data":{"":"","programme#Programme":"","programme-détaillé#Programme détaillé":"Inscrivez-vous sur LinkedIn Events.\nSamedi 14 octobre 2023, en ligne DataFrogs est une conférence communautaire gratuite sur Microsoft SQL Server.\nCette session aura lieu le samedi 14 octobre 2023, en virtuel (Les liens pour les sessions Microsoft Teams seront disponibles quelques jours avant la conférence).\nInscrivez-vous sur LinkedIn Events pour obtenir les informations pratiques.\nIl y aura cette fois-ci six sessions, la conférence se tiendra du matin jusqu’en fin d’après-midi. La dernière session sera une session discussion où vous pourrez poser vos questions, partager vos expériences, etc. à micros ouverts. Profitez-en, beaucoup de gens de Microsoft seront présents !\nLes sessions seront disponibles pour tous, et les enregistrements seront ensuite posés sur la chaîne YouTube de DataFrogs.\nProgramme Heure Session Qui Lien 09h00 SQL Server Hybride Azure Stéphane Scherrer, Microsoft et Richard Prade, Microsoft Lien Teams 10h15 La gestion des droits dans SQL Server Sébastien Kobenan Lien Teams 11h30 Migrer un groupe de disponibilité AlwaysOn sans perte du cluster Stéphane Scherrer, Microsoft et Sylvain Pagès, Devoteam Lien Teams 13h30 Faire cohabiter le décisionnel et le Transactionnel dans SQL Server Amar Adghar, Microsoft et Julien Pierre, Microsoft Lien Teams 14h45 Utiliser les indicateurs de requêtes pour aider l’optimiseur Arian Papillon, Datafly, MVP Lien Teams 16h00 Discussion ! Tout le monde Lien Teams Programme détaillé 09h00 ➤ SQL Server Hybride Azure Stéphane Scherrer, Microsoft et Richard Prade, Microsoft\nMême si vous voulez garder les données chez vous, l’hybridation vous permet d’ouvrir de nouveaux horizons avec SQL Server 2022.\nSujets abordés :\nCe qu’apporte SQL Server 2022. C’est quoi l’hybride ? Les tableaux de bords globaux et les outils pour se simplifier la vie. Les modes d’hybridation. Quelques scénarios simples comme le stockage des données froides (sans stretch data) et le DR. Interroger les données en langage naturel. 10h15 ➤ La gestion des droits dans SQL Server Sébastien Kobenan\nLorsqu’on débute sur SQL Server, on est souvent perdu dans la gestion des permissions.\nOn découvre des notions comme serveur, login, user ou role et on ne sait pas toujours les différencier ni dans quelles situations les utiliser.\nJe vous propose dans cette session de revenir sur les bases de la sécurité dans SQL Server.\nNous verrons :\nla différence entre un serveur de base de données, une base de données et un schéma. la différence entre un login, un user et un rôle comment attribuer ou refuser des droits à un utilisateur Si le temps nous le permet, nous verrons en bonus, les modes d’authentification dans SQL Server et surtout l’authentification Azure AD dans SQL Server 2022.\n11h30 ➤ Migrer un groupe de disponibilité AlwaysOn sans perte du cluster Stéphane Scherrer, Microsoft et Sylvain Pagès, Devoteam\nComment migrer un Cluster WSFC et AlwaysOn AG sans perte du cluster. Un point sur HA (High Availability) et DR (Distaster Recovery) Considérations sur le SLA (Service Level Agreement) Préparation du groupe de disponibilité. Alors, on conserve le même hardware ou non ? Démo, bien sûr ! Retour d’expérience Liens et références utiles 13h30 ➤ Faire cohabiter le décisionnel et le Transactionnel dans SQL Server Amar Adghar, Microsoft et Julien Pierre, Microsoft\nLe but de cette session est de comprendre les principes de la modélisation transactionnelle, versus la modélisation décisionnelle et de voir comment cela se traduit concrètement dans SQL Server.\nQuelles sont les bonnes pratiques ? Peut-on faire communiquer un environnement décisionnel et transactionnel sur une même instance ? Dans une même base ? Et avec la haute disponibilité, est-ce que ça marche ? Dans cette session nous essaierons de répondre a ces questions et bien plus encore ;) …\n14h45 ➤ Utiliser les indicateurs de requêtes pour aider l’optimiseur Arian Papillon, Datafly, MVP\nL’optimiseur de SQL Server décide du meilleur plan d’exécution et il s’en débrouille plutôt bien. Mais comment faire pour lui forcer la main si on est sûr de pouvoir faire mieux que lui ?\nDans cette session, nous parcourons les indicateurs de requêtes (ou Query Hints) et observons leurs effets.\n16h00 ➤ Discussion Question ? Anecdotes ? Retours d’expérience ? Venez discuter avec nous !","samedi-14-octobre-2023-en-ligne#Samedi 14 octobre 2023, en ligne":""},"title":"DataFrogs 2023.02"},"/docs/datafrogs-2024.01.fr/":{"data":{"":"","programme#Programme":"","programme-détaillé#Programme détaillé":"Inscrivez-vous sur LinkedIn Events.\nSamedi 1 juin 2024, en ligne DataFrogs est une conférence communautaire gratuite sur Microsoft SQL Server.\nCette session aura lieu le samedi 1 juin 2024, en virtuel (Les liens pour les sessions Microsoft Teams seront disponibles quelques jours avant la conférence).\nInscrivez-vous sur LinkedIn Events pour obtenir les informations pratiques.\nIl y aura cette fois-ci cinq sessions, la conférence se tiendra du matin jusqu’en fin d’après-midi. La dernière session sera une session Questions/Réponses où vous pourrez poser vos questions, partager vos expériences, etc. à micros ouverts. Profitez-en !\nLes sessions seront disponibles pour tous, et les enregistrements seront ensuite posés sur la chaîne YouTube de DataFrogs.\nProgramme Heure Session Qui Lien 09h00 Azure Arc SQL Julien Pierre, Microsoft et Richard Prade, Microsoft Lien Teams 10h15 Les Dernières Nouveautés Azure SQL Database et On-Prem Julien Pierre, Microsoft et Richard Prade, Microsoft Lien Teams 11h30 Cas Client: amélioration des performances et de la maintenance des tables volumétriques et fortement sollicitées Clément Hugé Lien Teams 13h30 Nettoyage des instances et bases de données SQL Server Frédéric Brouard, SQL Spot et Arian Papillon, Datafly, MVP Lien Teams 14h45 Migration de base de données SQL vers le cloud - Retour d’expérience David Barabarin, Migros Online Lien Teams 16h00 Questions / Réponses aux experts SQL - session collective à micros ouverts Micros ouverts Lien Teams Programme détaillé 09h00 ➤ Azure Arc SQL Julien Pierre, Microsoft et Richard Prade, Microsoft\nAzure Arc étend les services Azure aux instances SQL Server hébergées en dehors d’Azure.\nAzure Arc vous permet donc de gérer toutes vos instances SQL Server à partir d’un point de contrôle unique : Azure. Julien et Richard vous présentent cette technologie et vous montrent comment l’utiliser pour gérer vos instances SQL Server.\n10h15 ➤ Les Dernières Nouveautés Azure SQL Database et On-Prem Julien Pierre, Microsoft et Richard Prade, Microsoft\nLes dernières nouveautés de SQL Server 2022 et Azure SQL Database. Toutes fraîches.\n11h30 ➤ Cas Client: amélioration des performances et de la maintenance des tables volumétriques et fortement sollicitées Clément Hugé\nComment résoudre des problèmes de maintenance et de performance avec le partitionnement de données, en étant sur l’édition standard de SQL server 2022 ? Clément présentera un cas concret chez un client chez Google Cloud qui a mis en place une architecture découplée pour intégrer les mesures et configurations des équipements sur le terrain vers une base de données centralisée MSSQL server sur la plateforme managée Google Cloud SQL.\nClément présentera l’architecture découplée, la méthodologie des tests de sollicitation et la mise en place de la nouvelle structure des tables.\n13h30 ➤ Nettoyage des instances et bases de données SQL Server Frédéric Brouard, SQL Spot et Arian Papillon, Datafly, MVP\nCombien de login avez vous qui ne servent plus à rien ? Combien d’utilisateurs SQL sont orphelins dans mes bases ? Méfions nous de l’impersonalisation… EXECUTE AS ! Combien de bases ne sont plus accédées ? Combien de fichiers de données ou de groupes de fichiers sont vides ? Combien de table ne sont plus accédés ? Combien d’index ne sont plus utilisés ? Combien d’index sont redondants ou inclus ? Combien de statistiques sont redondantes ? 14h45 ➤ Migration de base de données SQL vers le cloud - Retour d’expérience David Barabarin, Migros Online\nSi vous envisagez de migrer votre plateforme de base de données SQL vers Azure, cette session suscitera certainement votre intérêt avec un retour d’expérience concret de migration dans le cadre d’une stratégie cloud first et d’un environnement orienté devops et microservices.\nBien que ce projet de migration ait été vaste, nous mettrons un accent particulier sur la partie plateforme de base de données incluant plusieurs chapitres tels que les objectifs business, la collaboration, la planification, les phases de conception de l’architecture cloud et défis techniques à relever pour réussir cette migration.\n16h00 ➤ Questions / Réponses aux experts SQL Session collective à micros ouverts\nQuestion ? Anecdotes ? Retours d’expérience ? Venez discuter avec nous !\nSi les experts ne savent pas, on demandera à ChatGPT.","samedi-1-juin-2024-en-ligne#Samedi 1 juin 2024, en ligne":""},"title":"DataFrogs 2024.01"},"/docs/datafrogs-2025.01.fr/":{"data":{"":"","samedi-28-juin-2025-en-ligne#Samedi 28 juin 2025, en ligne":"Inscrivez-vous sur LinkedIn Events.\nSamedi 28 juin 2025, en ligne DataFrogs est une conférence communautaire gratuite sur Microsoft SQL Server.\nCette session aura lieu le samedi 28 juin 2025, en virtuel (Les liens pour les sessions Microsoft Teams seront disponibles quelques jours avant la conférence).\nInscrivez-vous sur LinkedIn Events pour obtenir les informations pratiques.\nLes sessions seront disponibles pour tous, et les enregistrements seront ensuite posés sur la chaîne YouTube de DataFrogs."},"title":"DataFrogs 2025.01"}}